In [ ]:
# Group_by() function belongs to the dplyr package in the R programming language, which groups the data frames.

In [4]:
library(dplyr)

mydata2 <-iris 

head(mydata2,2)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
2 4.9          3.0         1.4          0.2         setosa

In [9]:
# Here, Find Mean of Sepal.Length is grouped by Species variable.

summarise_at(group_by(mydata2,Species),vars(Sepal.Length),funs(mean(.,na.rm=TRUE)))

  Species    Sepal.Length
1 setosa     5.006
2 versicolor 5.936
3 virginica  6.588

### Groupby in R without dplyr using aggregate function:

In [13]:
aggregate(mydata2$Sepal.Length, by=list(Species=mydata2$Species), FUN=mean)

  Species    x
1 setosa     5.006
2 versicolor 5.936
3 virginica  6.588

### Groupby function in R with dplyr pipe operator %>%:

In [11]:
mydata2 %>% group_by(Species) %>% summarise_at(vars(Sepal.Length),funs(mean(.,na.rm=TRUE)))

  Species    Sepal.Length
1 setosa     5.006
2 versicolor 5.936
3 virginica  6.588

In [14]:
# find max 
mydata2 %>% group_by(Species) %>% summarise_at(vars(Sepal.Length),funs(max(.,na.rm=TRUE)))

  Species    Sepal.Length
1 setosa     5.8
2 versicolor 7.0
3 virginica  7.9

In [15]:
# find sum 

mydata2 %>% group_by(Species) %>% summarise_at(vars(Sepal.Length),funs(sum(.,na.rm=TRUE)))

  Species    Sepal.Length
1 setosa     250.3
2 versicolor 296.8
3 virginica  329.4

In [16]:
# find min
mydata2 %>% group_by(Species) %>% summarise_at(vars(Sepal.Length),funs(min(.,na.rm=TRUE)))

  Species    Sepal.Length
1 setosa     4.3
2 versicolor 4.9
3 virginica  4.9

In [17]:
mydata2 %>% group_by(Species) %>% summarise(sum = sum(Sepal.Length),max = max(Sepal.Length))

  Species    sum   max
1 setosa     250.3 5.8
2 versicolor 296.8 7.0
3 virginica  329.4 7.9

In [18]:
# Get the count

read.csv("sampledata\\vehicle.csv") -> data

data2 = data %>% 
          group_by(State) %>% 
          summarize(counts = n())

head(data2,5)

  State counts
1 *      1
2 AK     4
3 AL    26
4 AR     9
5 AZ    61

In [20]:
# 01 : Get statistics

# Group by
data2 = data %>%
          group_by(State) %>%
            summarise(Avg_lc = mean(lc),
            sd_lc = sd(lc),
            max_lc = max(lc),
            min_lc = min(lc),
            sum_lc = sum(lc),
            median_lc = median(lc),
            total = n()) %>%
            arrange(desc(Avg_lc))

head(data2)

  State Avg_lc    sd_lc     max_lc  min_lc sum_lc   median_lc total
1 HI    1009.5375 1486.2478 3234.41 150.66  4038.15 326.540     4
2 NV     382.2489  287.0126 1186.80   0.00  6880.48 360.345    18
3 NM     342.0317  371.7031 1268.21  56.76  4104.38 232.320    12
4 NJ     331.2081  465.8369 2263.12   0.00  6955.37 223.460    21
5 AZ     315.1595  151.0170  715.76  16.11 19224.73 299.340    61
6 CA     285.1001  202.5608 1121.10   0.00 57020.03 234.340   200

In [21]:
data2 = data %>%
         group_by(State) %>%
            summarise(total_fm = sum(fm),Average_mileage = mean(Mileage),totak_lh = sum(lh))

head(data2,5)

  State total_fm Average_mileage totak_lh
1 *       6      59525.00          0.9
2 AK     26      16356.00          7.1
3 AL    215      21321.92        118.5
4 AR     60      11615.56         29.7
5 AZ    697      22039.13        253.3

## Group By : Multiple Column

In [22]:
read.csv("sampledata\\data2.csv") -> data

head(data,4)

  X target sex  fbs   exang cp           restecg     slope ca thal age trestbps
1 1 NO     MALE <=120 NO    ASYMPTOMATIC ABNORMALITY 2     2  3    52  125
2 2 NO     MALE >120  YES   ASYMPTOMATIC NORMAL      0     0  3    53  140
3 3 NO     MALE <=120 YES   ASYMPTOMATIC ABNORMALITY 0     0  3    70  145
4 4 NO     MALE <=120 NO    ASYMPTOMATIC ABNORMALITY 2     1  3    61  148
  chol thalach oldpeak
1 212  168     1.0
2 203  155     3.1
3 174  125     2.6
4 203  161     0.0

In [23]:
data2 = data %>%
            group_by(sex,cp) %>%
                summarise(total_trestbps = sum(trestbps),
                             avg_Age = mean(age),
                             .groups = 'drop')
data2

  sex    cp               total_trestbps avg_Age
1 FEMALE ASYMPTOMATIC     20450          57.89041
2 FEMALE ATYPICAL ANGINA   7313          51.98246
3 FEMALE NON-ANGINAL PAIN 13952          55.13761
4 MALE   ASYMPTOMATIC     56114          55.10748
5 MALE   ATYPICAL ANGINA  14083          50.86364
6 MALE   NON-ANGINAL PAIN 22990          52.50857